0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    XMin
    {
        type fixedValue;
        value uniform (1 0 0);
    }
    XMax
    {
        type zeroGradient;
    }
    YMin
    {
        type slip;
    }
    YMax
    {
        type slip;
    }
    ZMin
    {
        type slip;
    }
    ZMax
    {
        type slip;
    }
    ball
    {
        type noSlip;
    }
}


// ************************************************************************* //
