0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    XMin
    {
        type zeroGradient;
    }
    XMax
    {
        type fixedValue;
        value uniform 0.0;
    }
    YMin
    {
        type zeroGradient;
    }
    YMax
    {
        type zeroGradient;
    }
    ZMin
    {
        type zeroGradient;
    }
    ZMax
    {
        type zeroGradient;
    }
    ball
    {
        type zeroGradient;
    }
}

// ************************************************************************* //
