0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 2 -3 0 0 0 0];
internalField uniform 9.43E-05; //L=4m (10%)
boundaryField
{
    XMin
    {
        type fixedValue;
        value $internalField;
    }
    XMax
    {
        type zeroGradient;
    }
    YMin
    {
        type zeroGradient;
    }
    YMax
    {
        type zeroGradient;
    }
    ZMin
    {
        type zeroGradient;
    }
    ZMax
    {
        type zeroGradient;
    }
    ball
    {
        type epsilonWallFunction;
        value uniform 0.0;
    }
}

// ************************************************************************* //
